upd skills: digraph => mermaid
